<?php

return [
    'ByteToKB' => 'ByteToKB (байты в килобайты)',
    'ByteToMB' => 'ByteToMB (байты в мегабайты)',
    'ByteToGB' => 'ByteToGB (байты в гигайбайты)',
    'ByteToTB' => 'ByteToTB (байты в терабайты)',
    'KBToMB' => 'KBToMB (килобайты в мегабайты)',
    'KBToGB' => 'KBToGB (килобайты в гигайбайты)',
    'KBToTB' => 'KBToTB (килобайты в терабайты)',
    'MBToGB' => 'MBToGB (мегабайты в гигайбайты)',
    'MBToTB' => 'MBToTB (мегабайты в терабайты)',
    'GBToTB' => 'GBToTB (гигайбайты в терабайты)',

    'Fixed' => 'Фиксированное значение',
    'fixed help' => 'В качестве значения индикатора будет использовано значение, указанное в текущей форме.'
        .' Для применения значения по-умолчанию в поле "Организация" используйте опцию "Для всех компаний".',

    'Expression' => 'Выражение',
    'expression help' => 'В качестве значения индикатора будет использован результат вычисления выражения, указанного'
        .' в поле значения. В качестве выражения поддерживаются различные математические операции. Для получения'
        .' рассчитанного значения индикатора используйте переменную <span class="font-mono font-bold">value</span>. Пример:'
        .' "<span class="italic font-mono">value / 1024 + 35</span>"',
];
