<div class="text-sm text-gray-500">
    <div>Поддерживаются динамические вставки:</div>

    <ul class='pl-2'>
        <li>&bull; <i>d</i> - день месяца с ведущим нулём, от 01 до 31</li>
        <li>&bull; <i>j</i> - день месяца без ведущего нуля, от 1 до 31</li>
        <li>&bull; <i>m</i> - номер месяца с ведущим нулём, от 01 до 12</li>
        <li>&bull; <i>n</i> - номер месяца без ведущего нуля, от 1 до 12</li>
        <li>&bull; <i>Y</i> - полное представление года, 4 цифры</li>
        <li>&bull; <i>y</i> - короткое представление года, 2 цифры</li>
    </ul>

    <div>
        Для использования вставки, поместите её код в фигурные скобки,<br/>
        например <i>/tmp/report-{Y}-{m}-{d}.csv</i>
    </div>
</div>
